# ApplicationClosingEventArgs Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ApplicationClosingEventArgs Members
ApplicationClosingEventArgs Class Methods Properties See Also
---
The ApplicationClosingEventArgs type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Cancel | When the event is cancellable, may call the Cancel() method to cancel it.  (Inherited from RevitAPIPreEventArgs.) |
| Dispose | (Inherited from RevitAPIEventArgs.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| IsCancelled | Indicates whether the event is being cancelled.  (Inherited from RevitAPIEventArgs.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Cancellable | Indicates whether an event may be cancelled by an event delegate.  (Inherited from RevitAPIEventArgs.) |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from RevitAPIEventArgs.) |

# See Also
ApplicationClosingEventArgs Class
Autodesk.Revit.UI.Events Namespace